/**
Order (הזמנה)

אחריות: ניהול פרטי ההזמנה – אילו פריטים הוזמנו, הסכום הכולל, ומעקב אחר מצב תשלום 

Payment (תשלום)

אחריות: ניהול התשלום עבור הזמנה מסוימת – קבלת סכום, סוג תשלום  תאריך וקישור להזמנה שעליה משלם 

Item (פריט)

אחריות: מייצגת פריט  בהזמנה – שמירת מידע על שם, מחיר וכמות.

Customer (לקוח)

אחריות: ניהול פרטי הלקוח – מידע זיהוי ורשימת ההזמנות של הלקוח.
 * 

 */


/**
 * לכל תשלום יש קוד הזמנה שעליו בעצם משלמים. לפי התשלום נבדוק שאכן יש כזו הזמנה במערכת.
 * בתוך תשלום יהיה שדה של סכום שהוא צריך להיות זהה לשדה של מחיר בהזמנה
 * אחרי שנשלם נעדכן את סטטוס ההזמנה לשולם וכך לא יהיה תשלום כפול על אותה הזמנה.
 */

